<a href="https://colab.research.google.com/github/zje5027/GP3/blob/main/GP_3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#  ORIGINAL ER Diagram

In [ ]:
![ER diagram of media rental sevice](https://nbviewer.jupyter.org/github/zje5027/Group_Lab_2/blob/main/Group%20Lab%202.png)

/bin/bash: -c: line 0: syntax error near unexpected token `('
/bin/bash: -c: line 0: `[ER diagram of media rental sevice](https://nbviewer.jupyter.org/github/zje5027/Group_Lab_2/blob/main/Group%20Lab%202.png)'

![ER diagram of media rental sevice](https://nbviewer.jupyter.org/github/zje5027/Group_Lab_2/blob/main/Group%20Lab%202.png)

# UPDATED ER Diagram

In [ ]:
![Updates](https://raw.githubusercontent.com/zje5027/First-Google-NoteBook/master/Group%2520Lab%25202.png)

/bin/bash: -c: line 0: syntax error near unexpected token `https://raw.githubusercontent.com/zje5027/First-Google-NoteBook/master/Group%2520Lab%25202.png'
/bin/bash: -c: line 0: `[Updates](https://raw.githubusercontent.com/zje5027/First-Google-NoteBook/master/Group%2520Lab%25202.png)'

# Define SQL

In [ ]:
%load_ext sql
%sql sqlite:///libraryDatabase.db

'Connected: @libraryDatabase.db'

# Create Tables

In [ ]:
%%sql  
DROP TABLE IF EXISTS Books;
create table Books (BOOK_ID_NUMBER text PRIMARY KEY, Author text, Publisher real, Genre text);

DROP table IF EXISTS Transactions;
create table Transactions (transactionID text PRIMARY KEY, RentalType text, DateTime text);

 * sqlite:///libraryDatabase.db
Done.
Done.
Done.
Done.

[]

In [ ]:
%%sql
DROP TABLE IF EXISTS Movies;
create table Movies (Title text PRIMARY KEY, Director text, Actors text, Playtime real);

DROP TABLE IF EXISTS Magazines;
create table Magazines (Issue text PRIMARY KEY, Publisher text, Date text, Journalist real);

DROP TABLE IF EXISTS Newspaper;
create table Newspaper (UniqueID text PRIMARY KEY, Company Name text, Issue text, Stories real);

 * sqlite:///libraryDatabase.db
Done.
Done.
Done.
Done.
Done.
Done.

[]

# Insert Data

In [ ]:
%%sql
insert into Books values ('98723171', 'George R R Martin', 1, 'Fantasy');
insert into Books values ('83231231', 'J K Rowling', 1, 'Fantasy');
insert into Books values ('75351143', 'Ernest Hemingway', 1, 'Fiction');
insert into Books values ('63532454', 'Mark Twain', 2, 'Non-Fiction');
insert into Books values ('55234231', 'F Scott Fitzgerald', 3, 'Fiction');
insert into Books values ('43423413', 'William Shakespeare', 4, 'Thriller');
insert into Books values ('34242312', 'Charles Dickens', 5, 'Mystery');

insert into Transactions values ('01', '56224432', '2019-11-14 19:12:54');
insert into Transactions values ('02', '43423413', '2019-11-15 12:12:12');
insert into Transactions values ('03', '43423413', '2019-11-15 12:12:20');
insert into Transactions values ('04', '98723171', '2019-11-15 12:12:23');
insert into Transactions values ('05', '83231231', '2019-11-15 19:34:23');
insert into Transactions values ('06', '63532454', '2019-11-15 19:34:25');
insert into Transactions values ('07', '43423413', '2019-11-15 19:34:30');
insert into Transactions values ('08', '98723171', '2019-11-15 19:40:03');
insert into Transactions values ('09', '55234231', '2019-11-15 19:40:05');
insert into Transactions values ('10', '55234231', '2019-11-15 19:41:30');

 * sqlite:///libraryDatabase.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [ ]:
%%sql
insert into Movies values ('The Matrix', 'Wachowski Sisters','Keanu Reeves', 120);
insert into Movies values ('V for Vendetta', 'Wachowski Sisters', 'Hugo Weaving', 120);
insert into Movies values ('2001 A Space Odyssey', 'Stanley Kubrick', 'Keir Dullea', 120 );
insert into Movies values ('The Dark Knight', 'Christopher Nolan', 'Christian Bale', 120);
insert into Movies values ('21 JumpStreet', 'Zach End', "Joahna Hill", 90 );
insert into Movies values ('Spaceballs', 'Mel Gibson', 'Rick Moranis', 90 );
insert into Movies values ('John Wick', 'David Leitch', 'Keanu Reeves', 90 );

insert into Newspaper values ('The Matrix', 'Wachowski Sisters','Keanu Reeves', 120);
insert into Newspaper values ('V for Vendetta', 'Wachowski Sisters', 'Hugo Weaving', 120);
insert into Newspaper values ('2001 A Space Odyssey', 'Stanley Kubrick', 'Keir Dullea', 120 );
insert into Newspaper values ('The Dark Knight', 'Christopher Nolan', 'Christian Bale', 120);
insert into Newspaper values ('21 JumpStreet', 'Zach End', "Joahna Hill", 90 );
insert into Newspaper values ('Spaceballs', 'Mel Gibson', 'Rick Moranis', 90 );
insert into Newspaper values ('John Wick', 'David Leitch', 'Keanu Reeves', 90 );

insert into Magazines values ('The Matrix', 'Wachowski Sisters','Keanu Reeves', 120);
insert into Magazines values ('V for Vendetta', 'Wachowski Sisters', 'Hugo Weaving', 120);
insert into Magazines values ('2001 A Space Odyssey', 'Stanley Kubrick', 'Keir Dullea', 120 );
insert into Magazines values ('The Dark Knight', 'Christopher Nolan', 'Christian Bale', 120);
insert into Magazines values ('21 JumpStreet', 'Zach End', "Joahna Hill", 90 );
insert into Magazines values ('Spaceballs', 'Mel Gibson', 'Rick Moranis', 90 );
insert into Magazines values ('John Wick', 'David Leitch', 'Keanu Reeves', 90 );

 * sqlite:///libraryDatabase.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

# PrintOut_Test

In [ ]:
%%sql

select * from Books;

 * sqlite:///libraryDatabase.db
Done.

[('98723171', 'George R R Martin', 1.0, 'Fantasy'),
 ('83231231', 'J K Rowling', 1.0, 'Fantasy'),
 ('75351143', 'Ernest Hemingway', 1.0, 'Fiction'),
 ('63532454', 'Mark Twain', 2.0, 'Non-Fiction'),
 ('55234231', 'F Scott Fitzgerald', 3.0, 'Fiction'),
 ('43423413', 'William Shakespeare', 4.0, 'Thriller'),
 ('34242312', 'Charles Dickens', 5.0, 'Mystery')]

In [ ]:
%%sql
select * from Movies;

 * sqlite:///libraryDatabase.db
Done.

[('The Matrix', 'Wachowski Sisters', 'Keanu Reeves', 120.0),
 ('V for Vendetta', 'Wachowski Sisters', 'Hugo Weaving', 120.0),
 ('2001 A Space Odyssey', 'Stanley Kubrick', 'Keir Dullea', 120.0),
 ('The Dark Knight', 'Christopher Nolan', 'Christian Bale', 120.0),
 ('21 JumpStreet', 'Zach End', 'Joahna Hill', 90.0),
 ('Spaceballs', 'Mel Gibson', 'Rick Moranis', 90.0),
 ('John Wick', 'David Leitch', 'Keanu Reeves', 90.0)]

In [ ]:
%%sql

select * from Transactions;

 * sqlite:///libraryDatabase.db
Done.

[('01', '56224432', '2019-11-14 19:12:54'),
 ('02', '43423413', '2019-11-15 12:12:12'),
 ('03', '43423413', '2019-11-15 12:12:20'),
 ('04', '98723171', '2019-11-15 12:12:23'),
 ('05', '83231231', '2019-11-15 19:34:23'),
 ('06', '63532454', '2019-11-15 19:34:25'),
 ('07', '43423413', '2019-11-15 19:34:30'),
 ('08', '98723171', '2019-11-15 19:40:03'),
 ('09', '55234231', '2019-11-15 19:40:05'),
 ('10', '55234231', '2019-11-15 19:41:30')]

In [ ]:
%%sql

select * from Magazines;

 * sqlite:///libraryDatabase.db
Done.

[('The Matrix', 'Wachowski Sisters', 'Keanu Reeves', 120.0),
 ('V for Vendetta', 'Wachowski Sisters', 'Hugo Weaving', 120.0),
 ('2001 A Space Odyssey', 'Stanley Kubrick', 'Keir Dullea', 120.0),
 ('The Dark Knight', 'Christopher Nolan', 'Christian Bale', 120.0),
 ('21 JumpStreet', 'Zach End', 'Joahna Hill', 90.0),
 ('Spaceballs', 'Mel Gibson', 'Rick Moranis', 90.0),
 ('John Wick', 'David Leitch', 'Keanu Reeves', 90.0)]

In [ ]:
%%sql 
select * from Newspaper;

 * sqlite:///libraryDatabase.db
Done.

[('The Matrix', 'Wachowski Sisters', 'Keanu Reeves', 120.0),
 ('V for Vendetta', 'Wachowski Sisters', 'Hugo Weaving', 120.0),
 ('2001 A Space Odyssey', 'Stanley Kubrick', 'Keir Dullea', 120.0),
 ('The Dark Knight', 'Christopher Nolan', 'Christian Bale', 120.0),
 ('21 JumpStreet', 'Zach End', 'Joahna Hill', 90.0),
 ('Spaceballs', 'Mel Gibson', 'Rick Moranis', 90.0),
 ('John Wick', 'David Leitch', 'Keanu Reeves', 90.0)]

# Questions

How many authors have the letters 'e' and 's' next to each other?

In [ ]:
%%sql

select Author from Books where Author like '%es%';

 * sqlite:///libraryDatabase.db
Done.

[('Ernest Hemingway',), ('William Shakespeare',), ('Charles Dickens',)]

How many transactions were completed on the 15th of Novemebr in 2019?

In [ ]:
%%sql

select count(transactionID) from transactions where DateTime like '2019-11-15%';

 * sqlite:///libraryDatabase.db
Done.

[(9,)]

What is the longest movie that can be rented that features Keanu Reeves as the main actor?

In [ ]:
%%sql
select Title from Movies WHERE Actors LIKE '%Keanu%';

 * sqlite:///libraryDatabase.db
Done.

[('The Matrix',), ('John Wick',)]